Revit 2027 API
UV.IsUnitLength Method
The boolean value indicates whether this 2-D vector is of unit length.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsUnitLength()
Public Function IsUnitLength As Boolean
public:
bool IsUnitLength()
member IsUnitLength : unit -> bool
Return Value
Boolean
Remarks
 A unit length vector has a length of one, and is considered normalized.
See Also
Reference
UV Class
Autodesk.Revit.DB Namespace